Revit 2024 API
ReleaseConditions Class
 An object that represents a Release Conditions on analytical element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public class ReleaseConditions : IDisposable
Visual Basic
Public Class ReleaseConditions _
	Implements IDisposable
Visual C++
public ref class ReleaseConditions : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.ReleaseConditions
See Also
ReleaseConditions Members
Autodesk.Revit.DB.Structure Namespace